In [4]:
import pandas as pd
data=pd.read_excel("data.xlsx")
print(data)

  firstname lastname  marks
0   vandana    yadav   24.0
1    mukesh    gupta   78.0
2   shubham      NaN   12.0
3      jiya      NaN    NaN
4      pihu      NaN    NaN

In [5]:
data.fillna("vandu",inplace=True)

In [6]:
data.head()

  firstname lastname  marks
0   vandana    yadav     24
1    mukesh    gupta     78
2   shubham    vandu     12
3      jiya    vandu  vandu
4      pihu    vandu  vandu

In [17]:
import pandas as pd
data1=pd.read_excel("data.xlsx")
data1["lastname"].fillna("yadav",inplace=True)
data1.head()

  firstname lastname  marks
0   vandana    yadav   24.0
1    mukesh    gupta   78.0
2   shubham    yadav   12.0
3      jiya    yadav    NaN
4      pihu    yadav    NaN

In [20]:

x=data1["marks"].mean()
data1["marks"].fillna(x,inplace=True)
data1.head()

  firstname lastname  marks
0   vandana    yadav   24.0
1    mukesh    gupta   78.0
2   shubham    yadav   12.0
3      jiya    yadav   38.0
4      pihu    yadav   38.0

In [22]:
x=data2["marks"].median()
data2["marks"].fillna(x,inplace=True)
data2.head()

  firstname lastname  marks
0   vandana    yadav   24.0
1    mukesh    gupta   78.0
2   shubham      NaN   12.0
3      jiya      NaN   38.0
4      pihu      NaN   38.0

In [23]:
x=data1["marks"].mode()[0]
data1["marks"].fillna(x,inplace=True)
data1.head()

  firstname lastname  marks
0   vandana    yadav   24.0
1    mukesh    gupta   78.0
2   shubham    yadav   12.0
3      jiya    yadav   38.0
4      pihu    yadav   38.0